; domain
(define (domain miconic)
  (:requirements :strips)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(not-boarded ?person - passenger)
;; true if ?person has not boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(not-served ?person - passenger)
;; true if ?person is not at their destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (boarded ?p))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
(define (problem mixed-f31-p17-u0-v0-d0-a0-n0-A0-B0-N0-F0)
   (:domain miconic)
   (:objects p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 
             p10 p11 p12 p13 p14 p15 p16 - passenger
             f0 f1 f2 f3 f4 f5 f6 f7 f8 f9 
             f10 f11 f12 f13 f14 f15 f16 f17 f18 f19 
             f20 f21 f22 f23 f24 f25 f26 f27 f28 f29 
             f30 - floor)


(:init
(above f0 f1)
(above f0 f2)
(above f0 f3)
(above f0 f4)
(above f0 f5)
(above f0 f6)
(above f0 f7)
(above f0 f8)
(above f0 f9)
(above f0 f10)
(above f0 f11)
(above f0 f12)
(above f0 f13)
(above f0 f14)
(above f0 f15)
(above f0 f16)
(above f0 f17)
(above f0 f18)
(above f0 f19)
(above f0 f20)
(above f0 f21)
(above f0 f22)
(above f0 f23)
(above f0 f24)
(above f0 f25)
(above f0 f26)
(above f0 f27)
(above f0 f28)
(above f0 f29)
(above f0 f30)

(above f1 f2)
(above f1 f3)
(above f1 f4)
(above f1 f5)
(above f1 f6)
(above f1 f7)
(above f1 f8)
(above f1 f9)
(above f1 f10)
(above f1 f11)
(above f1 f12)
(above f1 f13)
(above f1 f14)
(above f1 f15)
(above f1 f16)
(above f1 f17)
(above f1 f18)
(above f1 f19)
(above f1 f20)
(above f1 f21)
(above f1 f22)
(above f1 f23)
(above f1 f24)
(above f1 f25)
(above f1 f26)
(above f1 f27)
(above f1 f28)
(above f1 f29)
(above f1 f30)

(above f2 f3)
(above f2 f4)
(above f2 f5)
(above f2 f6)
(above f2 f7)
(above f2 f8)
(above f2 f9)
(above f2 f10)
(above f2 f11)
(above f2 f12)
(above f2 f13)
(above f2 f14)
(above f2 f15)
(above f2 f16)
(above f2 f17)
(above f2 f18)
(above f2 f19)
(above f2 f20)
(above f2 f21)
(above f2 f22)
(above f2 f23)
(above f2 f24)
(above f2 f25)
(above f2 f26)
(above f2 f27)
(above f2 f28)
(above f2 f29)
(above f2 f30)

(above f3 f4)
(above f3 f5)
(above f3 f6)
(above f3 f7)
(above f3 f8)
(above f3 f9)
(above f3 f10)
(above f3 f11)
(above f3 f12)
(above f3 f13)
(above f3 f14)
(above f3 f15)
(above f3 f16)
(above f3 f17)
(above f3 f18)
(above f3 f19)
(above f3 f20)
(above f3 f21)
(above f3 f22)
(above f3 f23)
(above f3 f24)
(above f3 f25)
(above f3 f26)
(above f3 f27)
(above f3 f28)
(above f3 f29)
(above f3 f30)

(above f4 f5)
(above f4 f6)
(above f4 f7)
(above f4 f8)
(above f4 f9)
(above f4 f10)
(above f4 f11)
(above f4 f12)
(above f4 f13)
(above f4 f14)
(above f4 f15)
(above f4 f16)
(above f4 f17)
(above f4 f18)
(above f4 f19)
(above f4 f20)
(above f4 f21)
(above f4 f22)
(above f4 f23)
(above f4 f24)
(above f4 f25)
(above f4 f26)
(above f4 f27)
(above f4 f28)
(above f4 f29)
(above f4 f30)

(above f5 f6)
(above f5 f7)
(above f5 f8)
(above f5 f9)
(above f5 f10)
(above f5 f11)
(above f5 f12)
(above f5 f13)
(above f5 f14)
(above f5 f15)
(above f5 f16)
(above f5 f17)
(above f5 f18)
(above f5 f19)
(above f5 f20)
(above f5 f21)
(above f5 f22)
(above f5 f23)
(above f5 f24)
(above f5 f25)
(above f5 f26)
(above f5 f27)
(above f5 f28)
(above f5 f29)
(above f5 f30)

(above f6 f7)
(above f6 f8)
(above f6 f9)
(above f6 f10)
(above f6 f11)
(above f6 f12)
(above f6 f13)
(above f6 f14)
(above f6 f15)
(above f6 f16)
(above f6 f17)
(above f6 f18)
(above f6 f19)
(above f6 f20)
(above f6 f21)
(above f6 f22)
(above f6 f23)
(above f6 f24)
(above f6 f25)
(above f6 f26)
(above f6 f27)
(above f6 f28)
(above f6 f29)
(above f6 f30)

(above f7 f8)
(above f7 f9)
(above f7 f10)
(above f7 f11)
(above f7 f12)
(above f7 f13)
(above f7 f14)
(above f7 f15)
(above f7 f16)
(above f7 f17)
(above f7 f18)
(above f7 f19)
(above f7 f20)
(above f7 f21)
(above f7 f22)
(above f7 f23)
(above f7 f24)
(above f7 f25)
(above f7 f26)
(above f7 f27)
(above f7 f28)
(above f7 f29)
(above f7 f30)

(above f8 f9)
(above f8 f10)
(above f8 f11)
(above f8 f12)
(above f8 f13)
(above f8 f14)
(above f8 f15)
(above f8 f16)
(above f8 f17)
(above f8 f18)
(above f8 f19)
(above f8 f20)
(above f8 f21)
(above f8 f22)
(above f8 f23)
(above f8 f24)
(above f8 f25)
(above f8 f26)
(above f8 f27)
(above f8 f28)
(above f8 f29)
(above f8 f30)

(above f9 f10)
(above f9 f11)
(above f9 f12)
(above f9 f13)
(above f9 f14)
(above f9 f15)
(above f9 f16)
(above f9 f17)
(above f9 f18)
(above f9 f19)
(above f9 f20)
(above f9 f21)
(above f9 f22)
(above f9 f23)
(above f9 f24)
(above f9 f25)
(above f9 f26)
(above f9 f27)
(above f9 f28)
(above f9 f29)
(above f9 f30)

(above f10 f11)
(above f10 f12)
(above f10 f13)
(above f10 f14)
(above f10 f15)
(above f10 f16)
(above f10 f17)
(above f10 f18)
(above f10 f19)
(above f10 f20)
(above f10 f21)
(above f10 f22)
(above f10 f23)
(above f10 f24)
(above f10 f25)
(above f10 f26)
(above f10 f27)
(above f10 f28)
(above f10 f29)
(above f10 f30)

(above f11 f12)
(above f11 f13)
(above f11 f14)
(above f11 f15)
(above f11 f16)
(above f11 f17)
(above f11 f18)
(above f11 f19)
(above f11 f20)
(above f11 f21)
(above f11 f22)
(above f11 f23)
(above f11 f24)
(above f11 f25)
(above f11 f26)
(above f11 f27)
(above f11 f28)
(above f11 f29)
(above f11 f30)

(above f12 f13)
(above f12 f14)
(above f12 f15)
(above f12 f16)
(above f12 f17)
(above f12 f18)
(above f12 f19)
(above f12 f20)
(above f12 f21)
(above f12 f22)
(above f12 f23)
(above f12 f24)
(above f12 f25)
(above f12 f26)
(above f12 f27)
(above f12 f28)
(above f12 f29)
(above f12 f30)

(above f13 f14)
(above f13 f15)
(above f13 f16)
(above f13 f17)
(above f13 f18)
(above f13 f19)
(above f13 f20)
(above f13 f21)
(above f13 f22)
(above f13 f23)
(above f13 f24)
(above f13 f25)
(above f13 f26)
(above f13 f27)
(above f13 f28)
(above f13 f29)
(above f13 f30)

(above f14 f15)
(above f14 f16)
(above f14 f17)
(above f14 f18)
(above f14 f19)
(above f14 f20)
(above f14 f21)
(above f14 f22)
(above f14 f23)
(above f14 f24)
(above f14 f25)
(above f14 f26)
(above f14 f27)
(above f14 f28)
(above f14 f29)
(above f14 f30)

(above f15 f16)
(above f15 f17)
(above f15 f18)
(above f15 f19)
(above f15 f20)
(above f15 f21)
(above f15 f22)
(above f15 f23)
(above f15 f24)
(above f15 f25)
(above f15 f26)
(above f15 f27)
(above f15 f28)
(above f15 f29)
(above f15 f30)

(above f16 f17)
(above f16 f18)
(above f16 f19)
(above f16 f20)
(above f16 f21)
(above f16 f22)
(above f16 f23)
(above f16 f24)
(above f16 f25)
(above f16 f26)
(above f16 f27)
(above f16 f28)
(above f16 f29)
(above f16 f30)

(above f17 f18)
(above f17 f19)
(above f17 f20)
(above f17 f21)
(above f17 f22)
(above f17 f23)
(above f17 f24)
(above f17 f25)
(above f17 f26)
(above f17 f27)
(above f17 f28)
(above f17 f29)
(above f17 f30)

(above f18 f19)
(above f18 f20)
(above f18 f21)
(above f18 f22)
(above f18 f23)
(above f18 f24)
(above f18 f25)
(above f18 f26)
(above f18 f27)
(above f18 f28)
(above f18 f29)
(above f18 f30)

(above f19 f20)
(above f19 f21)
(above f19 f22)
(above f19 f23)
(above f19 f24)
(above f19 f25)
(above f19 f26)
(above f19 f27)
(above f19 f28)
(above f19 f29)
(above f19 f30)

(above f20 f21)
(above f20 f22)
(above f20 f23)
(above f20 f24)
(above f20 f25)
(above f20 f26)
(above f20 f27)
(above f20 f28)
(above f20 f29)
(above f20 f30)

(above f21 f22)
(above f21 f23)
(above f21 f24)
(above f21 f25)
(above f21 f26)
(above f21 f27)
(above f21 f28)
(above f21 f29)
(above f21 f30)

(above f22 f23)
(above f22 f24)
(above f22 f25)
(above f22 f26)
(above f22 f27)
(above f22 f28)
(above f22 f29)
(above f22 f30)

(above f23 f24)
(above f23 f25)
(above f23 f26)
(above f23 f27)
(above f23 f28)
(above f23 f29)
(above f23 f30)

(above f24 f25)
(above f24 f26)
(above f24 f27)
(above f24 f28)
(above f24 f29)
(above f24 f30)

(above f25 f26)
(above f25 f27)
(above f25 f28)
(above f25 f29)
(above f25 f30)

(above f26 f27)
(above f26 f28)
(above f26 f29)
(above f26 f30)

(above f27 f28)
(above f27 f29)
(above f27 f30)

(above f28 f29)
(above f28 f30)

(above f29 f30)



(origin p0 f23)
(destin p0 f28)

(origin p1 f22)
(destin p1 f11)

(origin p2 f19)
(destin p2 f0)

(origin p3 f14)
(destin p3 f24)

(origin p4 f5)
(destin p4 f17)

(origin p5 f25)
(destin p5 f24)

(origin p6 f29)
(destin p6 f7)

(origin p7 f30)
(destin p7 f13)

(origin p8 f10)
(destin p8 f23)

(origin p9 f15)
(destin p9 f7)

(origin p10 f21)
(destin p10 f23)

(origin p11 f6)
(destin p11 f12)

(origin p12 f10)
(destin p12 f22)

(origin p13 f22)
(destin p13 f26)

(origin p14 f8)
(destin p14 f0)

(origin p15 f16)
(destin p15 f3)

(origin p16 f22)
(destin p16 f27)






(lift-at f0)
)


(:goal


(and
(served p0)
(served p1)
(served p2)
(served p3)
(served p4)
(served p5)
(served p6)
(served p7)
(served p8)
(served p9)
(served p10)
(served p11)
(served p12)
(served p13)
(served p14)
(served p15)
(served p16)
))
)

; plan
1. (up f0 f6)
   deleted: (lift-at f0)
   added: (lift-at f6)
   goals met: 0 of 17
2. (board f6 p11)
   added: (boarded p11)
   goals met: 0 of 17
3. (up f6 f30)
   deleted: (lift-at f6)
   added: (lift-at f30)
   goals met: 0 of 17
4. (board f30 p7)
   added: (boarded p7)
   goals met: 0 of 17
5. (down f30 f19)
   deleted: (lift-at f30)
   added: (lift-at f19)
   goals met: 0 of 17
6. (board f19 p2)
   added: (boarded p2)
   goals met: 0 of 17
7. (down f19 f16)
   deleted: (lift-at f19)
   added: (lift-at f16)
   goals met: 0 of 17
8. (board f16 p15)
   added: (boarded p15)
   goals met: 0 of 17
9. (down f16 f15)
   deleted: (lift-at f16)
   added: (lift-at f15)
   goals met: 0 of 17
10. (board f15 p9)
   added: (boarded p9)
   goals met: 0 of 17
11. (down f15 f14)
   deleted: (lift-at f15)
   added: (lift-at f14)
   goals met: 0 of 17
12. (board f14 p3)
   added: (boarded p3)
   goals met: 0 of 17
13. (down f14 f13)
   deleted: (lift-at f14)
   added: (lift-at f13)
   goals met: 0 of 17
14. (depart f13 p7)
   deleted: (boarded p7)
   added: (served p7)
   goals met: 1 of 17
15. (down f13 f12)
   deleted: (lift-at f13)
   added: (lift-at f12)
   goals met: 1 of 17
16. (depart f12 p11)
   deleted: (boarded p11)
   added: (served p11)
   goals met: 2 of 17
17. (down f12 f10)
   deleted: (lift-at f12)
   added: (lift-at f10)
   goals met: 2 of 17
18. (board f10 p8)
   added: (boarded p8)
   goals met: 2 of 17
19. (board f10 p12)
   added: (boarded p12)
   goals met: 2 of 17
20. (down f10 f3)
   deleted: (lift-at f10)
   added: (lift-at f3)
   goals met: 2 of 17
21. (depart f3 p15)
   deleted: (boarded p15)
   added: (served p15)
   goals met: 3 of 17
22. (up f3 f21)
   deleted: (lift-at f3)
   added: (lift-at f21)
   goals met: 3 of 17
23. (board f21 p10)
   added: (boarded p10)
   goals met: 3 of 17
24. (down f21 f5)
   deleted: (lift-at f21)
   added: (lift-at f5)
   goals met: 3 of 17
25. (board f5 p4)
   added: (boarded p4)
   goals met: 3 of 17
26. (up f5 f17)
   deleted: (lift-at f5)
   added: (lift-at f17)
   goals met: 3 of 17
27. (depart f17 p4)
   deleted: (boarded p4)
   added: (served p4)
   goals met: 4 of 17
28. (down f17 f8)
   deleted: (lift-at f17)
   added: (lift-at f8)
   goals met: 4 of 17
29. (board f8 p14)
   added: (boarded p14)
   goals met: 4 of 17
30. (down f8 f0)
   deleted: (lift-at f8)
   added: (lift-at f0)
   goals met: 4 of 17
31. (depart f0 p14)
   deleted: (boarded p14)
   added: (served p14)
   goals met: 5 of 17
32. (depart f0 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 6 of 17
33. (up f0 f22)
   deleted: (lift-at f0)
   added: (lift-at f22)
   goals met: 6 of 17
34. (board f22 p1)
   added: (boarded p1)
   goals met: 6 of 17
35. (board f22 p13)
   added: (boarded p13)
   goals met: 6 of 17
36. (board f22 p16)
   added: (boarded p16)
   goals met: 6 of 17
37. (depart f22 p12)
   deleted: (boarded p12)
   added: (served p12)
   goals met: 7 of 17
38. (down f22 f11)
   deleted: (lift-at f22)
   added: (lift-at f11)
   goals met: 7 of 17
39. (depart f11 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 8 of 17
40. (up f11 f23)
   deleted: (lift-at f11)
   added: (lift-at f23)
   goals met: 8 of 17
41. (board f23 p0)
   added: (boarded p0)
   goals met: 8 of 17
42. (depart f23 p10)
   deleted: (boarded p10)
   added: (served p10)
   goals met: 9 of 17
43. (depart f23 p8)
   deleted: (boarded p8)
   added: (served p8)
   goals met: 10 of 17
44. (up f23 f25)
   deleted: (lift-at f23)
   added: (lift-at f25)
   goals met: 10 of 17
45. (board f25 p5)
   added: (boarded p5)
   goals met: 10 of 17
46. (down f25 f24)
   deleted: (lift-at f25)
   added: (lift-at f24)
   goals met: 10 of 17
47. (depart f24 p3)
   deleted: (boarded p3)
   added: (served p3)
   goals met: 11 of 17
48. (depart f24 p5)
   deleted: (boarded p5)
   added: (served p5)
   goals met: 12 of 17
49. (up f24 f26)
   deleted: (lift-at f24)
   added: (lift-at f26)
   goals met: 12 of 17
50. (depart f26 p13)
   deleted: (boarded p13)
   added: (served p13)
   goals met: 13 of 17
51. (up f26 f27)
   deleted: (lift-at f26)
   added: (lift-at f27)
   goals met: 13 of 17
52. (depart f27 p16)
   deleted: (boarded p16)
   added: (served p16)
   goals met: 14 of 17
53. (up f27 f28)
   deleted: (lift-at f27)
   added: (lift-at f28)
   goals met: 14 of 17
54. (depart f28 p0)
   deleted: (boarded p0)
   added: (served p0)
   goals met: 15 of 17
55. (up f28 f29)
   deleted: (lift-at f28)
   added: (lift-at f29)
   goals met: 15 of 17
56. (board f29 p6)
   added: (boarded p6)
   goals met: 15 of 17
57. (down f29 f7)
   deleted: (lift-at f29)
   added: (lift-at f7)
   goals met: 15 of 17
58. (depart f7 p6)
   deleted: (boarded p6)
   added: (served p6)
   goals met: 16 of 17
59. (depart f7 p9)
   deleted: (boarded p9)
   added: (served p9)
   goals met: 17 of 17
